app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
def list
    @products = Product.all

INSERT INTO "products" ("name", "desc", "enabled", "created_at", "updated_at") VALUES ('Feature 1', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.', 0, '2012-09-27 09:20:20.145480', '2012-09-27 09:20:20.145480')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
UPDATE "products" SET "desc" = 'dsdsdssd', "updated_at" = '2012-09-27 09:29:09.715386' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."id" = 0 LIMIT 1
UPDATE "products" SET "enabled" = NULL, "updated_at" = '2012-09-27 11:01:55.256521' WHERE "products"."id" = 3
---
  def update_products
	  puts "----------"
	  puts params
	  puts "----------"

	  if !params["product"].blank?
		  params["product"].each{|k, v|
		   puts "----------"
		   p1 =   k
		   pro=   Product.find(k.to_i)
		   puts p1
		   values = v
		   p values
		   if  v["enabled"].to_i == 1
			   pro.enabled = true

		else
			 pro.enabled = false
			   end
		pro.save